NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/EFR32MG21B010F1024IM32.svd
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007D</resetMask>
          <fields>
            <field>
              <name>RSSIVALID</name>
              <description>RSSIVALID Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA</name>
              <description>CCA Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSIPOSSTEP</name>
              <description>RSSIPOSSTEP Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSINEGSTEP</name>
              <description>RSSINEGSTEP Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHORTRSSIPOSSTEP</name>
              <description>SHORTRSSIPOSSTEP Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINRANGE</name>
          <description>No Description</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0x08813187</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNAINDEXBORDER</name>
              <description>LNA gain border</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGAINDEXBORDER</name>
              <description>PGA gain border</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAININCSTEP</name>
              <description>AGC gain increase step size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PNGAINSTEP</name>
              <description>PN Gain Step size</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LATCHEDHISTEP</name>
              <description>Ltached Hi step size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIPWRTHD</name>
              <description>High power detect thrshold</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOSTLNA</name>
              <description>LNA GAIN BOOST mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNABWADJ</name>
              <description>LNA BW ADJUST</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGCPERIOD</name>
          <description>No Description</description>
          <addressOffset>0x054</addressOffset>
          <access>read-write</access>
          <resetValue>0xD607370E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PERIODHI</name>
              <description>AGC measure period hi</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIODLO</name>
              <description>AGC measure period low</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAXHICNTTHD</name>
              <description>max hi-countrer threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETTLETIMEIF</name>
              <description>IF peak Detector settling time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETTLETIMERF</name>
              <description>RF peak Detector settling time</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HICNTREGION</name>
          <description>No Description</description>
          <addressOffset>0x058</addressOffset>
          <access>read-write</access>
          <resetValue>0x08060543</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HICNTREGION0</name>
              <description>AGC HICNT to step size map region 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HICNTREGION1</name>
              <description>AGC HICNT to step size map region 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HICNTREGION2</name>
              <description>AGC HICNT to step size map region 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HICNTREGION3</name>
              <description>AGC HICNT to step size map region 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HICNTREGION4</name>
              <description>AGC HICNT to step size map region 4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STEPDWN</name>
          <description>No Description</description>
          <addressOffset>0x05C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00036D11</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>STEPDWN0</name>
              <description>AGC gain step size 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEPDWN1</name>
              <description>AGC gain step size 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEPDWN2</name>
              <description>AGC gain step size 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEPDWN3</name>
              <description>AGC gain step size 3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEPDWN4</name>
              <description>AGC gain step size 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEPDWN5</name>
              <description>AGC gain step size 5</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINSTEPLIM</name>
          <description>No Description</description>
          <addressOffset>0x064</addressOffset>
          <access>read-write</access>
          <resetValue>0x00003144</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>CFLOOPSTEPMAX</name>
              <description>Maximum step in slow loop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFLOOPDEL</name>
              <description>Channel Filter Loop Delay</description>
              <bitOffset>5</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYST</name>
              <description>Hysteresis</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAXPWRVAR</name>
              <description>Maximum Power Variation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANRSTAGC</name>
              <description>power transient detector Reset AGC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PNRFATT0</name>
          <description>No Description</description>
          <addressOffset>0x068</addressOffset>
          <access>read-write</access>
          <resetValue>0x06102040</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNAMIXRFATT1</name>
              <description>PN RF attenuation code for index 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFATT2</name>
              <description>PN RF attenuation code for index 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFATT3</name>
              <description>PN RF attenuation code for index 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFATT4</name>
              <description>PN RF attenuation code for index 4</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFATT5</name>
              <description>PN RF attenuation code for index 5</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PNRFATT1</name>
          <description>No Description</description>
          <addressOffset>0x06C</addressOffset>
          <access>read-write</access>
          <resetValue>0x1848F2C8</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNAMIXRFATT6</name>
              <description>PN RF attenuation code for index 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFATT7</name>
              <description>PN RF attenuation code for index 7</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFATT8</name>
              <description>PN RF attenuation code for index 8</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFATT9</name>
              <description>PN RF attenuation code for index 9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFATT10</name>
              <description>PN RF attenuation code for index 10</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PNRFATT2</name>
          <description>No Description</description>
          <addressOffset>0x070</addressOffset>
          <access>read-write</access>
          <resetValue>0x00F6E81F</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>LNAMIXRFATT11</name>
              <description>PN RF attenuation code for index 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFATT12</name>
              <description>PN RF attenuation code for index 12</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFATT13</name>
              <description>PN RF attenuation code for index 13</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXRFATT14</name>
              <description>PN RF attenuation code for index 14</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LNAMIXCODE0</name>
          <description>No Description</description>
          <addressOffset>0x074</addressOffset>
          <access>read-write</access>
          <resetValue>0x15724BBD</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNAMIXSLICE1</name>
              <description>LNA/MIX slice code for index 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXSLICE2</name>
              <description>LNA/MIX slice code for index 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXSLICE3</name>
              <description>LNA/MIX slice code for index 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXSLICE4</name>
              <description>LNA/MIX slice code for index 4</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXSLICE5</name>
              <description>LNA/MIX slice code for index 5</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LNAMIXCODE1</name>
          <description>No Description</description>
          <addressOffset>0x078</addressOffset>
          <access>read-write</access>
          <resetValue>0x0518A311</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNAMIXSLICE6</name>
              <description>LNA/MIX slice code for index 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXSLICE7</name>
              <description>LNA/MIX slice code for index 7</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXSLICE8</name>
              <description>LNA/MIX slice code for index 8</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXSLICE9</name>
              <description>LNA/MIX slice code for index 9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNAMIXSLICE10</name>
              <description>LNA/MIX slice code for index 10</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PGACODE0</name>
          <description>No Description</description>
          <addressOffset>0x07C</addressOffset>
          <access>read-write</access>
          <resetValue>0x76543210</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PGAGAIN1</name>
              <description>PGA GAIN code for index 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGAGAIN2</name>
              <description>PGA GAIN code for index 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGAGAIN3</name>
              <description>PGA GAIN code for index 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGAGAIN4</name>
              <description>PGA GAIN code for index 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGAGAIN5</name>
              <description>PGA GAIN code for index 5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGAGAIN6</name>
              <description>PGA GAIN code for index 6</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGAGAIN7</name>
              <description>PGA GAIN code for index 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGAGAIN8</name>
              <description>PGA GAIN code for index 8</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PGACODE1</name>
          <description>No Description</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000A98</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>PGAGAIN9</name>
              <description>PGA GAIN code for index 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGAGAIN10</name>
              <description>PGA GAIN code for index 10</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGAGAIN11</name>
              <description>PGA GAIN code for index 11</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
